grevaillot/svd_tools/headers/ATSAML11D14A/memorymap.h
#pragma once 

#define PAC_BASE			(0x40000000)
#define PAC_SEC_BASE			(0x40000200)
#define PM_BASE			(0x40000400)
#define MCLK_BASE			(0x40000800)
#define RSTC_BASE			(0x40000c00)
#define OSCCTRL_BASE			(0x40001000)
#define OSC32KCTRL_BASE			(0x40001400)
#define SUPC_BASE			(0x40001800)
#define GCLK_BASE			(0x40001c00)
#define WDT_BASE			(0x40002000)
#define RTC_BASE			(0x40002400)
#define EIC_BASE			(0x40002800)
#define EIC_SEC_BASE			(0x40002a00)
#define FREQM_BASE			(0x40002c00)
#define PORT_BASE			(0x40003000)
#define PORT_SEC_BASE			(0x40003200)
#define AC_BASE			(0x40003400)
#define IDAU_BASE			(0x41000000)
#define DSU_BASE			(0x41002000)
#define DSU_EXT_BASE			(0x41002100)
#define NVMCTRL_BASE			(0x41004000)
#define NVMCTRL_SEC_BASE			(0x41005000)
#define DMAC_BASE			(0x41006000)
#define EVSYS_BASE			(0x42000000)
#define EVSYS_SEC_BASE			(0x42000200)
#define SERCOM0_BASE			(0x42000400)
#define SERCOM1_BASE			(0x42000800)
#define TC0_BASE			(0x42001000)
#define TC1_BASE			(0x42001400)
#define TC2_BASE			(0x42001800)
#define ADC_BASE			(0x42001c00)
#define DAC_BASE			(0x42002000)
#define PTC_BASE			(0x42002400)
#define TRNG_BASE			(0x42002800)
#define CCL_BASE			(0x42002c00)
#define OPAMP_BASE			(0x42003000)
#define TRAM_BASE			(0x42003400)
#define PORT_IOBUS_BASE			(0x60000000)
#define PORT_IOBUS_SEC_BASE			(0x60000200)
#define DWT_BASE			(0xe0001000)
#define FPB_BASE			(0xe0002000)
#define ICB_BASE			(0xe000e000)
#define SysTick_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define MPU_BASE			(0xe000ed90)
#define CoreDebug_BASE			(0xe000edf0)
#define DIB_BASE			(0xe000efb0)
#define ICB_NS_BASE			(0xe002e000)
#define SysTick_NS_BASE			(0xe002e010)
#define NVIC_NS_BASE			(0xe002e100)
#define SCB_NS_BASE			(0xe002ed00)
#define MPU_NS_BASE			(0xe002ed90)
#define CoreDebug_NS_BASE			(0xe002edf0)
#define DIB_NS_BASE			(0xe002efb0)
